### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_dynamodb_table.idol_table: Refreshing state... [id=idolGroupList]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.idol_table must be replaced
-/+ resource "aws_dynamodb_table" "idol_table" {
      ~ arn              = "arn:aws:dynamodb:ap-northeast-1:526378883024:table/idolGroupList" -> (known after apply)
      ~ hash_key         = "IdolType" -> "idolIdentifer" # forces replacement
      ~ id               = "idolGroupList" -> (known after apply)
        name             = "idolGroupList"
      ~ range_key        = "IdolName" -> "dataType" # forces replacement
      ~ read_capacity    = 0 -> (known after apply)
      + stream_arn       = (known after apply)
      - stream_enabled   = false -> null
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
      ~ write_capacity   = 0 -> (known after apply)
        # (1 unchanged attribute hidden)

      - attribute {
          - name = "IdolName" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "IdolType" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "UserDefinedIdolCategory" -> null
          - type = "S" -> null
        }
      + attribute {
          + name = "dataType"
          + type = "S"
        }
      + attribute {
          + name = "dataValue"
          + type = "S"
        }
      + attribute {
          + name = "idolIdentifer"
          + type = "S"
        }

      - global_secondary_index {
          - hash_key           = "IdolName" -> null
          - name               = "getByIdolName" -> null
          - non_key_attributes = [
              - "getByUserDefinedCategory",
              - "spotifyApiUrl",
              - "spotifyClientUrl",
              - "spotifyId",
            ] -> null
          - projection_type    = "INCLUDE" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
        }
      - global_secondary_index {
          - hash_key           = "UserDefinedIdolCategory" -> null
          - name               = "getByUserDefinedCategory" -> null
          - non_key_attributes = [
              - "IdolName",
              - "spotifyApiUrl",
              - "spotifyClientUrl",
              - "spotifyId",
            ] -> null
          - projection_type    = "INCLUDE" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
        }
      + global_secondary_index {
          + hash_key           = "dataType"
          + name               = "getByDataType"
          + non_key_attributes = [
              + "idolIdentifer",
            ]
          + projection_type    = "INCLUDE"
          + range_key          = "dataValue"
        }
      + global_secondary_index {
          + hash_key           = "dataValue"
          + name               = "getByDataValue"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "idolIdentifer"
        }

      ~ point_in_time_recovery {
          ~ enabled = false -> (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      ~ ttl {
          + attribute_name = (known after apply)
          ~ enabled        = false -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @scarlet0725, Action: `pull_request`, Workflow: `Terraform plan`*